[
  {
    "category": "general",
    "engines": [
      "360search",
      "alexandria",
      "ask",
      "baidu",
      "bing",
      "bpb",
      "brave",
      "cloudflareai",
      "crowdview",
      "curlie",
      "currency",
      "ddg definitions",
      "duckduckgo",
      "dictzone",
      "encyclosearch",
      "goo",
      "google",
      "libretranslate",
      "lingva",
      "mojeek",
      "mwmbl",
      "mymemory translated",
      "naver",
      "presearch",
      "qwant",
      "quark",
      "right dao",
      "searchmysite",
      "seznam",
      "sogou",
      "startpage",
      "stract",
      "tagesschau",
      "wiby",
      "wikidata",
      "wikipedia",
      "wolframalpha",
      "yacy",
      "yahoo",
      "yep"
    ],
    "discussion_on_spread": "Engines in 'general' show the widest spread:\n- **Geographic:** Strong focus on China (Baidu, 360search, Sogou, Quark), Japan (Goo), South Korea (Naver), Czech Republic (Seznam), Germany (bpb, Tagesschau), France/Europe (Qwant). Many others are global/US-centric (Google, Bing, DDG, Brave, Yep, Mojeek, Stract, Ask, Yahoo, Startpage). Some are highly specialized (Wikidata, Wikipedia - global but specific format; WolframAlpha - computational; translation engines - global). YaCy depends on peer location.\n- **Language:** Significant language barriers exist for engines focused on China, Japan, Korea, Czech Republic, Russia (if Habr considered general), Germany, Italy. Global engines primarily interface/index in English but handle multi-lingual content to varying degrees. Wikimedia (Wikipedia, Wikidata) are explicitly multi-lingual. Translation engines bridge languages.\n- **Content Focus:** Huge variation. Broad web crawlers (Google, Bing, Brave, DDG, Yep, Mojeek, Stract, regional engines), curated directories (Curlie), computational knowledge (WolframAlpha), structured data (Wikidata), encyclopedias (Wikipedia, EncycloSearch), Q&A (implied via Reddit integration elsewhere), translation utilities (LibreTranslate, Lingva, MyMemory), niche web (Wiby, SearchMySite), specific agency info (bpb, Tagesschau).\n- **Quality/User Perception:** Google/Bing are comprehensive benchmarks but raise privacy flags. DDG/Brave/Qwant/Startpage/Mojeek are privacy-focused alternatives, with varying index independence (Brave/Mojeek/Yep/Stract independent, others often rely on Bing/Google). Wikipedia highly trusted for encyclopedic info. WolframAlpha unique for computation. Regional engines essential for specific geographic queries. Ask/Yahoo generally seen as lower quality/ad-heavy. Niche engines (Wiby, SearchMySite) serve specific discovery goals.\n- **Selection/Overlap/Prioritization:** High overlap among broad web crawlers means differentiation hinges on privacy needs (DDG/Brave/Mojeek/Startpage vs Google/Bing), index source (Google vs Bing vs Independent crawlers), or regional relevance. A query for 'population of Paris' strongly suggests Wikidata or WolframAlpha. A query for 'define X' needs DDG Definitions. A query for 'translate X' requires a translation engine. A privacy-conscious user might prioritize DDG, Brave, Mojeek, Startpage. For max comprehensiveness, Google/Bing (or their proxies) are often prioritized. For alternative views, independent indexes (Brave, Mojeek, Yep, Stract) or niche engines (Wiby) might be chosen. Regional queries demand regional engines (Baidu, Naver, Seznam). YaCy offers decentralization.",
    "discussion_on_weighting": "Engine selection *within* the 'general' category matters significantly. The choice directly impacts result relevance, scope, privacy, and even result format. Using Google/Bing yields different results than Brave/Mojeek due to different indexes and ranking. Choosing a regional engine drastically changes results for non-local queries. Selecting Wikidata vs Wikipedia vs WolframAlpha addresses fundamentally different types of factual/computational queries. Prioritizing privacy leads to a specific subset of engines. This category has arguably the highest impact based on engine choice.",
    "discussion_on_format_specificity": "Format specificity varies greatly. Most return standard web links/snippets. However, several offer distinct formats:\n- **Direct Answers/Data:** Wikidata (structured data), WolframAlpha (computed answers, plots, data), DDG Definitions (definition text), Currency (conversion value).\n- **Specific Document Types:** Wikipedia (encyclopedia articles), bpb/Tagesschau (news/agency reports, potentially PDFs).\n- **Interactive/Utility:** Translation engines (translated text), CloudflareAI (model output, requires config). Curlie provides categorized directory links. Wiby/SearchMySite results link to specific types of simpler/independent web pages. YaCy results depend on the peer network content. This format variety is crucial for routing specific query types (computational, factual lookup, translation) to the correct engine.",
    "other_notes": "This category is often the default and covers the broadest range of user intent. It includes engines requiring configuration (YaCy peer URL, WolframAlpha AppID, translation instance URLs). Privacy is a major differentiator among many engines here. The 'general' label might sometimes obscure highly specialized engines like WolframAlpha or Wikidata that excel at non-web-page tasks."
  },
  {
    "category": "images",
    "engines": [
      "1x",
      "adobe stock",
      "artic",
      "baidu images",
      "bing images",
      "brave.images",
      "deviantart",
      "duckduckgo images",
      "findthatmeme",
      "flickr",
      "frinkiac",
      "google images",
      "imgur",
      "ipernity",
      "library of congress",
      "material icons",
      "mojeek images",
      "openverse",
      "pinterest",
      "presearch images",
      "public domain image archive",
      "qwant images",
      "quark images",
      "seekr images",
      "sogou images",
      "startpage images",
      "svgrepo",
      "tineye",
      "unsplash",
      "wallhaven",
      "wikicommons.images",
      "yacy images",
      "yep images"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Most major engines (Google, Bing, DDG, Brave, Qwant, Yep, Mojeek, Startpage, Presearch) aim for global image indexing. Regional focus exists for Baidu, Sogou, Quark (China). Specific collections have geographic ties (Artic - Chicago museum, LoC - US history).\n- **Language Spread:** Interfaces of global engines adapt or are English. Regional engines use regional languages. Platform engines (DeviantArt, Flickr, Pinterest, Imgur) mostly English interface, content descriptions vary. Wikimedia/Openverse multi-lingual. Specialized engines (FindThatMeme, Frinkiac, TinEye) typically English.\n- **Content Focus Spread:** Huge variation. General web image search (Google, Bing, DDG, Brave etc). High-quality/Stock photos (Unsplash - free, Adobe Stock - paid, Flickr - community/pro). Art/Curated (1x - fine art, Artic - museum, DeviantArt - community art). Specialized function (TinEye - reverse search, FindThatMeme - meme lookup by text, Frinkiac - Simpsons quote lookup). Icons/Vectors (Material Icons, SVGRepo). Wallpapers (Wallhaven). Public Domain/Open License (Openverse, Wikimedia Commons, Public Domain archives, Unsplash). Social/Visual Discovery (Pinterest, Imgur). P2P/Decentralized (YaCy).\n- **Quality/User Perception:** Google/Bing most comprehensive. Unsplash highly regarded for free quality stock. Flickr valued by photographers. Openverse/Wikimedia crucial for reliably free licensed media. Adobe Stock for professional paid assets. TinEye excellent for reverse search. Specialized engines essential for their niche tasks.\n- **Selection/Overlap/Prioritization:** Query intent dictates selection. 'Free photos for blog' -> Unsplash, Openverse, Public Domain. 'Find where this image came from' -> TinEye. 'Simpsons quote meme' -> Frinkiac. 'Material Design check icon' -> Material Icons. 'Professional illustration purchase' -> Adobe Stock. 'General cat pictures' -> Google/Bing/DDG/Brave. 'Privacy-focused image search' -> DDG/Brave/Qwant/Startpage/Mojeek. High overlap between general engines requires privacy/index source differentiation. Special function engines (TinEye, Frinkiac) have no overlap. Licensing needs heavily influence choice (Openverse/Commons/Unsplash vs Adobe).",
    "discussion_on_weighting": "Engine selection matters significantly. Choosing Google Images vs Unsplash vs TinEye serves entirely different user goals (broad search vs free stock vs reverse lookup). Within general search, the index difference (Google vs Bing vs Brave) matters less than in the 'general' text category, but privacy concerns still drive choices (DDG/Brave vs Google/Bing). Selection heavily depends on desired content type (photo, art, icon, meme), licensing, and specific function (reverse search).",
    "discussion_on_format_specificity": "High format specificity. Engines return primarily image previews and links, but the *type* and *purpose* of the image vary greatly:\n- **Downloadable Files:** Unsplash (photos), SVGRepo (SVG vectors), Material Icons (icons), Wikimedia Commons (various media files), Public Domain Archives (image files).\n- **Web Previews linking to platform/purchase:** Adobe Stock (paid assets), 1x (art gallery), Artic/LoC (museum/archive items), DeviantArt/Flickr/Pinterest/Imgur (platform content).\n- **Specific Result Types:** TinEye (links to image occurrences), Frinkiac/FindThatMeme (specific matching image frames/templates).\n- **General Web Image Previews:** Google, Bing, DDG, Brave, regional engines. Understanding if the user needs a downloadable file, a specific license, or just a visual reference is key for engine selection.",
    "other_notes": "Licensing is a critical factor in this category (Openverse, Commons, Unsplash vs Adobe Stock vs general web). Specialized function engines (TinEye, Frinkiac, FindThatMeme) are very useful for specific tasks. API keys often needed for better results (Flickr, Unsplash, Adobe). Reverse image search (TinEye) requires image input, not text."
  },
  {
    "category": "videos",
    "engines": [
      "360search videos",
      "acfun",
      "adobe stock video",
      "bilibili",
      "bing videos",
      "bitchute",
      "brave.videos",
      "dailymotion",
      "duckduckgo videos",
      "google play movies",
      "google videos",
      "ina",
      "invidious",
      "iqiyi",
      "livespace",
      "media.ccc.de",
      "mediathekviewweb",
      "niconico",
      "odysee",
      "peertube",
      "piped",
      "presearch videos",
      "qwant videos",
      "quark videos",
      "rumble",
      "seekr videos",
      "sepiasearch",
      "sogou videos",
      "vimeo",
      "wikicommons.videos",
      "youtube"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Dominated by global platform YouTube (accessed via direct engine, Invidious, Piped). Other global platforms include Vimeo, Dailymotion (strong European presence). Regional focus for China (Bilibili, AcFun, iQIYI, 360, Sogou, Quark), Japan (Niconico), France (INA archives), Germany/Austria/Switzerland (MediathekViewWeb), potentially North America (Rumble). Decentralized options (PeerTube via SepiaSearch, Odysee) are global but network size varies. CCC Media has European/German focus.\n- **Language Spread:** YouTube/Vimeo/Dailymotion interfaces global/multi-lingual, content varies immensely. Regional engines primarily use regional languages (Chinese, Japanese, French, German). Privacy frontends (Invidious, Piped) interfaces often multi-lingual. Decentralized platforms/archives mostly English interface, content varies. Bitchute/Rumble mostly English.\n- **Content Focus Spread:** General user-generated/professional content (YouTube, Vimeo, Dailymotion). Privacy-focused YouTube access (Invidious, Piped). Niche platforms emphasizing free speech/alternative content (Odysee, Rumble, Bitchute). Specific regional/cultural content (Bilibili, AcFun, Niconico - ACG; iQIYI - Chinese dramas; INA - French archives; MediathekViewWeb - German public TV). Decentralized/FOSS video hosting (PeerTube via SepiaSearch). Conference talks (media.ccc.de). Paid content (Adobe Stock Video, Google Play Movies). Educational/Free License (Wikimedia Commons Videos).\n- **Quality/User Perception:** YouTube has largest library. Vimeo known for higher quality/professional content. Dailymotion a solid alternative. Privacy frontends valued for ad/track-free YouTube. Niche platforms attract specific communities (politics, ACG, FOSS). Archives (INA, CCC) invaluable for their specific recordings.\n- **Selection/Overlap/Prioritization:** Most general video queries target YouTube, so choice becomes direct YT scraping (fragile) vs privacy frontends (Invidious/Piped - need config). For quality/professional content, Vimeo is a good choice. For specific regional content, the relevant regional engine is essential (Bilibili for Chinese ACG, Niconico for Japanese trends, INA for French archive). For FOSS/decentralized video, PeerTube/SepiaSearch. For specific political leanings, Rumble/Bitchute/Odysee. For conference talks, CCC media. For licensed stock, Adobe. Overlap primarily concerns accessing YouTube's library via different means.",
    "discussion_on_weighting": "Engine selection matters considerably based on desired content source and features. If the query implicitly targets YouTube (most common), the choice is between direct access and privacy frontends. If seeking high-quality non-YouTube content, Vimeo is key. If seeking region/culture-specific video, the appropriate regional engine is vital. Choosing Rumble vs Odysee targets specific political/alternative content niches. Weighting depends heavily on inferred source preference (YouTube vs specific platform vs archive vs decentralized network).",
    "discussion_on_format_specificity": "High specificity. Most return links/previews to video streams on hosting platforms (YouTube, Vimeo, Dailymotion, regional sites, P2P networks). Privacy frontends proxy these streams. Archives (INA, CCC) provide access to specific broadcast/talk recordings. Stock engines (Adobe) link to licensable footage. Media library engines (MediathekViewWeb) link to TV catch-up streams/downloads. Wikimedia provides downloadable video files. Understanding if user wants a YouTube video, a specific niche platform's content, an archive recording, or a licensed clip is key.",
    "other_notes": "YouTube dominance makes privacy frontends (Invidious, Piped) important alternatives if privacy is a concern. Decentralized options (PeerTube/SepiaSearch, Odysee) require instance configuration/awareness. Regional engines often have language barriers. Archive/library engines access unique content unavailable elsewhere."
  },
  {
    "category": "news",
    "engines": [
      "ansa",
      "bing news",
      "brave.news",
      "duckduckgo news",
      "google news",
      "il post",
      "mojeek news",
      "presearch news",
      "qwant news",
      "reuters",
      "seekr news",
      "sogou wechat",
      "startpage news",
      "tagesschau",
      "wikinews",
      "yahoo news",
      "yep news"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Major aggregators (Google, Bing, Yahoo, DDG, Brave, Qwant, Startpage, Mojeek, Yep, Presearch, Seekr) aim for global coverage but often reflect sources strong in user's region (especially US/Europe). Specific agencies provide focused views: Italy (ANSA, Il Post), Germany (Tagesschau), UK/Global (Reuters). Sogou WeChat is China-specific. Wikinews is global but small scale.\n- **Language Spread:** Global aggregators adapt interface, content depends on region/sources. Specific agencies primarily use their national language (Italian, German), though English sections may exist (Reuters is English-first). Sogou WeChat Chinese only. Wikinews multi-lingual.\n- **Content Focus Spread:** Broad aggregation from many sources (Google, Bing, Yahoo, DDG, Brave, etc.). Authoritative agency reporting (Reuters, ANSA, Tagesschau). In-depth analysis/explanatory journalism (Il Post). Citizen journalism (Wikinews). Aggregation with bias/reliability scoring (Seekr). Specific ecosystem content (Sogou WeChat).\n- **Quality/User Perception:** Agencies (Reuters, ANSA, Tagesschau) seen as reliable for factual reporting within their scope. Il Post respected for analysis (Italy). Google/Bing news comprehensive aggregators. DDG/Brave/Qwant/Startpage offer privacy. Seekr offers transparency scoring. Wikinews quality varies. Sogou WeChat essential for that ecosystem.\n- **Selection/Overlap/Prioritization:** For broad, diverse news, Google/Bing/Yahoo aggregators are standard. For privacy, DDG/Brave/Startpage/Qwant/Mojeek/Yep. For authoritative reporting from a specific region, use national agencies (ANSA, Tagesschau). For reliable global agency news, Reuters. For Italian analysis, Il Post. For scoring, Seekr. For WeChat content, Sogou WeChat (if working). Wikinews for niche citizen reports. Overlap is high among aggregators; differentiation comes from source weighting, privacy, scoring features, or specific agency focus.",
    "discussion_on_weighting": "Engine choice matters significantly for perspective, source reliability, and privacy. Choosing a specific agency (Reuters, ANSA) gives a focused, reliable view versus a broad aggregator (Google News) which mixes sources. Opting for Seekr implies interest in bias scoring. Privacy needs dictate using DDG/Brave etc. Choosing Sogou WeChat targets a unique, closed ecosystem. Weighting depends on whether user wants breadth, depth, specific agency trust, privacy, or scoring features.",
    "discussion_on_format_specificity": "Generally low format specificity. Most engines return lists of news headlines with snippets and links to the full articles on the original publisher's website. Exceptions might include: Sogou WeChat linking specifically within the WeChat platform, Wikinews linking to its own collaboratively written articles. The core result type is almost always a link to an external news article.",
    "other_notes": "Privacy is a key differentiator for many news engines mirroring 'general' search trends. Accessing region-specific news often best done via national agencies. Stability of Sogou WeChat integration is questionable."
  },
  {
    "category": "map",
    "engines": [
      "qwant"
    ],
    "discussion_on_spread": "Limited Spread: Only one engine, Qwant Maps, listed in the core set under this category. It leverages OpenStreetMap data but provides a distinct privacy-focused interface based in Europe (France).\n- **Geographic/Language:** Primarily European focus in POI density/features, but uses global OSM data. Interface likely multi-lingual including English.\n- **Content Focus:** Provides standard map features: address search, POI lookup, routing, based on OSM data.\n- **Quality/Selection:** Offers a privacy-respecting alternative to Google/Apple Maps, using reliable OSM data. Selection is limited to this single option in the provided list.",
    "discussion_on_weighting": "Very low impact within this configuration, as there's only one engine listed ('qwant' - likely meaning Qwant Maps here based on categories). If other map engines like OpenStreetMap (Nominatim/Photon) or Apple Maps were enabled/configured in SearXNG, the weighting would increase significantly based on data source preference (OSM vs Apple vs Google implied elsewhere) and privacy.",
    "discussion_on_format_specificity": "High specificity. The engine is expected to return geographic information: map tiles, addresses, point-of-interest details, latitude/longitude coordinates, potentially routes. Results are not web links but interactive map data or location information.",
    "other_notes": "The provided engine list only has 'qwant' listed explicitly with 'map' category. This strongly suggests Qwant Maps, likely using OSM data. A functional map category in SearXNG usually requires robust map engines like OpenStreetMap (Nominatim/Photon), or potentially others if configured."
  },
  {
    "category": "music",
    "engines": [
      "adobe stock audio",
      "bandcamp",
      "deezer",
      "genius",
      "invidious",
      "mixcloud",
      "piped",
      "piped.music",
      "qwant",
      "radio browser",
      "soundcloud",
      "wikicommons.audio",
      "youtube"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Major platforms (YouTube via various engines, Deezer, SoundCloud, Bandcamp, Genius) are global. Qwant has European roots but global reach. Adobe Stock global. Radio Browser lists global stations. Wikimedia global. Mixcloud global.\n- **Language Spread:** Interfaces largely English or multi-lingual. Content varies widely (lyrics on Genius, track names, radio station languages via Radio Browser). YouTube content global.\n- **Content Focus Spread:** Huge variation. Mainstream track streaming/discovery (Deezer, potentially YouTube/Piped/Invidious if seeking official music videos). Independent artists (Bandcamp, SoundCloud). Long-form audio/mixes/podcasts (Mixcloud, SoundCloud). Lyrics & annotations (Genius). Internet Radio streams (Radio Browser). Royalty-free licensed audio (Adobe Stock Audio). Freely licensed/Public Domain audio (Wikimedia Commons Audio). Privacy-focused YouTube access (Invidious, Piped, Piped.music).\n- **Quality/User Perception:** Deezer/YouTube offer huge mainstream catalogs. Bandcamp/SoundCloud essential for indie discovery. Genius definitive for lyrics. Radio Browser great for diverse radio. Mixcloud for DJ sets/shows. Adobe for licensed audio needs. Wikimedia for free reusable audio.\n- **Selection/Overlap/Prioritization:** Query heavily dictates choice. 'Lyrics for song X' -> Genius. 'Independent artist Y' -> Bandcamp, SoundCloud. 'Listen to radio station Z' -> Radio Browser. 'Royalty-free music for video' -> Adobe Stock Audio, Wikimedia Commons Audio. 'Listen to YouTube music privately' -> Piped, Invidious. 'DJ mix by A' -> Mixcloud, SoundCloud. General music track query might hit Deezer or YouTube (via Piped/Invidious). Qwant Music (likely via scraping qwant.com/music) probably aggregates or uses a partner API. Overlap exists in accessing tracks (Deezer vs YT), but focus differs greatly (lyrics vs streams vs mixes vs radio vs licensing).",
    "discussion_on_weighting": "Engine choice matters significantly based on desired audio type and format. Selecting Genius vs Deezer vs Radio Browser serves entirely different purposes (lyrics vs track stream vs radio stream). The need for licensed vs free vs indie content heavily weights the choice (Adobe vs Wikimedia vs Bandcamp). Privacy concerns favor Piped/Invidious for YT content.",
    "discussion_on_format_specificity": "High specificity. Results vary widely:\n- **Text:** Genius (lyrics, annotations).\n- **Audio Stream Links:** Deezer, YouTube/Piped/Invidious (tracks/videos), Mixcloud, SoundCloud (tracks/mixes/shows), Radio Browser (station streams).\n- **Downloadable Audio Files:** Wikimedia Commons Audio (freely licensed files).\n- **Purchase Links:** Bandcamp (digital/physical), Adobe Stock Audio (licensed files).\nUnderstanding if user wants lyrics, a stream, a file, licensed audio, or indie music is crucial.",
    "other_notes": "Privacy frontends (Piped, Invidious) require instance configuration. Licensing (Adobe, Wikimedia, Bandcamp purchases) is a key differentiator. Radio Browser offers unique access to live streams."
  },
  {
    "category": "it",
    "engines": [
      "alpine linux packages",
      "anaconda",
      "arch linux wiki",
      "askubuntu",
      "baidu developer",
      "bitbucket",
      "caddy.community",
      "codeberg",
      "cppreference",
      "crates.io",
      "discuss.python",
      "docker hub",
      "free software directory",
      "gentoo wiki",
      "github",
      "gitea.com",
      "gitlab",
      "habrahabr",
      "hackernews",
      "hex",
      "hoogle",
      "huggingface",
      "huggingface datasets",
      "huggingface spaces",
      "lib.rs",
      "lobste.rs",
      "mankier",
      "mdn",
      "media.ccc.de",
      "metacpan",
      "microsoft learn",
      "nixos wiki",
      "npm",
      "ollama",
      "packagist",
      "pi-hole.community",
      "pkg.go.dev",
      "pypi",
      "rubygems",
      "searchcode code",
      "sourcehut",
      "stackoverflow",
      "superuser",
      "voidlinux"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Most are global platforms/resources (GitHub, GitLab, Stack Overflow, MDN, package managers, Hugging Face, etc). Specific regional focus includes Habr (Russia), Baidu Developer (China). Wikis/docs are often tied to specific Linux distros but globally relevant (Arch, Gentoo, NixOS).\n- **Language Spread:** Predominantly English interfaces and content for global platforms, docs, Q&A sites. Habr primarily Russian. Baidu Developer primarily Chinese. Package descriptions often English.\n- **Content Focus Spread:** Extremely diverse within IT. Q&A/Troubleshooting (Stack Overflow, Ask Ubuntu, Super User). Code Hosting/Search (GitHub, GitLab, Bitbucket, Codeberg, Gitea, SourceHut, searchcode). Package Management (npm, PyPI, crates.io, RubyGems, Packagist, Hex, MetaCPAN, Anaconda, Alpine, Void). Documentation/Reference (MDN, cppreference, Arch Wiki, Gentoo Wiki, NixOS Wiki, Microsoft Learn, Mankier, Ollama docs). Tech News/Discussion (Hacker News, Lobsters, Habr, specific community forums like Caddy/Pi-hole/Discuss Python). AI/ML Resources (Hugging Face models/datasets/spaces). FOSS Specific (Free Software Directory, Codeberg, SourceHut). Conference Talks (media.ccc.de).\n- **Quality/User Perception:** Stack Overflow indispensable for coding problems. MDN authoritative for web docs. GitHub dominant for code hosting. Distro wikis (Arch, Gentoo) highly valued. Package managers essential for their ecosystems. Hugging Face central to AI/ML.\n- **Selection/Overlap/Prioritization:** Query specificity is paramount. 'Python error X' -> Stack Overflow. 'Find JS library for Y' -> npm. 'Install package Z on Alpine' -> Alpine Packages. 'Web API docs' -> MDN. 'Find FOSS project for Q' -> GitHub, Codeberg, SourceHut. 'Latest AI models' -> Hugging Face. 'Arch Linux config help' -> Arch Wiki. Overlap is low between sub-categories (e.g., package manager vs Q&A site). Selection within code hosting depends on where project lives (GitHub vs GitLab vs Codeberg). Prioritization based entirely on matching query type (question, package search, code search, doc lookup, discussion) to the specific engine's function.",
    "discussion_on_weighting": "Extremely high impact. Choosing the wrong engine type guarantees irrelevant results. Searching Stack Overflow for a Rust package (needs crates.io) or searching npm for C++ help (needs cppreference or Stack Overflow) will fail. Correctly identifying the *type* of IT resource needed (Q&A, code, package, docs, discussion, AI model) is critical for engine selection in this category.",
    "discussion_on_format_specificity": "Very high specificity. Results are highly distinct formats:\n- **Q&A Threads:** Stack Overflow, Ask Ubuntu, Super User.\n- **Code Files/Repositories:** GitHub, GitLab, Bitbucket, Codeberg, SourceHut, searchcode.\n- **Package Metadata:** npm, PyPI, crates.io, RubyGems, Packagist, Hex, MetaCPAN, Anaconda, Alpine Pkgs, Void Pkgs.\n- **Documentation Pages:** MDN, cppreference, distro wikis, Microsoft Learn, Mankier.\n- **Discussion Forum Threads:** Hacker News, Lobsters, Habr, specific community forums.\n- **AI Model/Dataset Cards:** Hugging Face.\n- **Software Listings:** Free Software Directory.\n- **Video/Audio Recordings:** media.ccc.de. Understanding the expected result format is key to routing queries.",
    "other_notes": "Many engines here benefit from API key configuration (GitHub, GitLab, Stack Exchange API). Package manager searches are language/ecosystem specific. Distro-specific engines (Alpine, Void, Ask Ubuntu, wikis) only relevant for users of those systems."
  },
  {
    "category": "science",
    "engines": [
      "arxiv",
      "crossref",
      "google scholar",
      "openairedatasets",
      "openairepublications",
      "pdbe",
      "pubmed",
      "semantic scholar",
      "wikispecies",
      "wolframalpha"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Most are global databases/resources (PubMed - US NIH base, Google Scholar, Semantic Scholar, arXiv, CrossRef, PDBe - European base, WolframAlpha). OpenAIRE has European focus but indexes globally. Wikispecies global.\n- **Language Spread:** Interfaces predominantly English. Literature indexed is global but heavily weighted towards English publications. WolframAlpha primarily English input. Wikispecies multi-lingual taxonomy.\n- **Content Focus Spread:** Broad scholarly literature (Google Scholar, Semantic Scholar, OpenAIRE Publications). Biomedical literature (PubMed). Physics/Math/CS preprints (arXiv). Protein/Molecule structures (PDBe). Species taxonomy (Wikispecies). Computational knowledge/data (WolframAlpha). Publication metadata/DOIs (CrossRef).\n- **Quality/User Perception:** PubMed essential for biomedical. Google Scholar comprehensive but less curated. Semantic Scholar adds AI insights. arXiv vital for fast preprint access in specific fields. CrossRef authoritative for DOIs/metadata. PDBe core for structural biology. OpenAIRE important for EU/OA tracking. Wikispecies for taxonomy. WolframAlpha unique for computation.\n- **Selection/Overlap/Prioritization:** Query determines choice. 'Latest physics paper on X' -> arXiv. 'Find biomedical articles on Y' -> PubMed, Google Scholar. 'Understand citations for paper Z' -> Semantic Scholar, Google Scholar. 'Find metadata for DOI ...' -> CrossRef. '3D structure of protein A' -> PDBe. 'Taxonomic classification of B' -> Wikispecies. 'Calculate C' -> WolframAlpha. 'Find datasets related to project D' -> OpenAIRE Datasets. Overlap exists between broad literature search (Google Scholar, Semantic Scholar, OpenAIRE Pubs), but specialized databases serve unique needs.",
    "discussion_on_weighting": "High impact. Choosing PubMed vs arXiv vs PDBe serves entirely different scientific query types (biomed literature vs physics preprints vs protein structures). The need for specific data (structures, taxonomy, computation) or literature type (preprint vs published vs OA) heavily dictates engine choice.",
    "discussion_on_format_specificity": "Very high specificity. Results vary greatly:\n- **Publication Abstracts/Metadata:** PubMed, Google Scholar, Semantic Scholar, OpenAIRE Pubs.\n- **Preprint PDFs/Source:** arXiv.\n- **Molecular Structure Data/Files:** PDBe.\n- **Taxonomic Data:** Wikispecies.\n- **Computed Answers/Data:** WolframAlpha.\n- **DOI Metadata Records:** CrossRef.\n- **Dataset Metadata Records:** OpenAIRE Datasets.\nUnderstanding if the user needs an abstract, a full paper, structure data, taxonomic info, or a computed result is vital.",
    "other_notes": "Many engines may require API keys for robust use (PubMed E-utils, CrossRef, Semantic Scholar, WolframAlpha, OpenAIRE). Full text access often requires external subscriptions beyond the metadata provided."
  },
  {
    "category": "files",
    "engines": [
      "1337x",
      "annas archive",
      "apk mirror",
      "apple app store",
      "bt4g",
      "btdigg",
      "fdroid",
      "google play apps",
      "kickass",
      "library genesis",
      "nyaa",
      "openrepos",
      "piratebay",
      "solidtorrents",
      "tokyotoshokan",
      "wikicommons.files",
      "z-library"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Torrent sites (1337x, Kickass, TPB, BT4G, BTDigg, Nyaa, Tokyo Toshokan, SolidTorrents) global but content often English/Japanese focused (Nyaa/Tokyo). App stores regionalized (Apple, Google) or global/niche (F-Droid, OpenRepos - Sailfish). Shadow libraries (LibGen, Z-Lib, Anna's) global. Wikimedia global.\n- **Language Spread:** Interfaces mostly English (except maybe regional app store views). Content language highly varied (torrents, apps, books).\n- **Content Focus Spread:** Very distinct sub-categories. BitTorrent search (many engines). App Stores (Google Play - Android, Apple - iOS/macOS, F-Droid - Android FOSS, OpenRepos - Sailfish). Shadow Libraries for documents/books (LibGen, Z-Lib, Anna's Archive). General freely licensed files (Wikimedia Commons Files).\n- **Quality/User Perception:** App stores official/curated (Apple/Google) or FOSS-focused (F-Droid). Torrent sites vary in quality/safety, Nyaa specific for anime. Shadow libraries comprehensive but legally dubious. Wikimedia trusted for free license.\n- **Selection/Overlap/Prioritization:** Zero overlap between major types. 'Find Android app X' -> Google Play, F-Droid (if FOSS), APKMirror (if specific version). 'Find iOS app Y' -> Apple App Store. 'Find torrent for movie Z' -> TPB, 1337x, Kickass, SolidTorrents. 'Find anime torrent A' -> Nyaa, Tokyo Toshokan. 'Find book B pdf/epub' -> LibGen, Z-Lib, Anna's Archive. 'Find free licensed document C' -> Wikimedia Commons Files. Query *must* specify file type intent (app, torrent, book, general file) for correct engine selection.",
    "discussion_on_weighting": "Extremely high impact. Selection is entirely dependent on the *type* of file being sought (app vs torrent vs book). Choosing an app store engine for a book query, or a torrent engine for an Android app, is guaranteed failure. Weighting is about mapping file type need to the correct specialized engine.",
    "discussion_on_format_specificity": "Extremely high specificity based on engine type:\n- **Torrent Engines:** Return magnet links or .torrent file metadata.\n- **App Stores:** Return links to application listing pages (for install via store).\n- **Direct APK Download:** APKMirror.\n- **Shadow Libraries:** Return direct download links for documents (PDF, EPUB, etc.).\n- **Wikimedia Commons:** Return links to downloadable files (PDF, images, etc.) with licenses. The *format* of the file sought (APK, PDF, EPUB, torrent metadata) dictates the engine choice.",
    "other_notes": "Torrent and shadow library engines often require updated mirror URLs in SearXNG configuration due to legal takedowns and instability. Using these carries legal/ethical risks depending on content/jurisdiction. App stores require platform context (Android vs iOS vs Sailfish)."
  },
  {
    "category": "social media",
    "engines": [
      "9gag",
      "deviantart",
      "flickr",
      "imgur",
      "lemmy comments",
      "lemmy communities",
      "lemmy posts",
      "lemmy users",
      "mastodon hashtags",
      "mastodon users",
      "pinterest",
      "reddit",
      "sogou wechat",
      "tootfinder"
    ],
    "discussion_on_spread": "- **Geographic Spread:** Most platforms global (Reddit, Flickr, Imgur, DeviantArt, Pinterest, Mastodon, Lemmy). Sogou WeChat specific to China.\n- **Language Spread:** Interfaces mostly English or adaptable. Content language highly variable depending on platform community/user base (Reddit varies by subreddit, Lemmy/Mastodon by instance/user, Sogou WeChat Chinese).\n- **Content Focus Spread:** Broad discussion/links (Reddit, Lemmy Posts, Mastodon via Hashtags/Tootfinder). Visual focus (Pinterest, Imgur, Flickr, DeviantArt, 9gag - humor focus). Specific ecosystem search (Sogou WeChat - articles, Lemmy/Mastodon users/communities - platform structure).\n- **Quality/User Perception:** Reddit dominant for general discussion. Flickr/DeviantArt for quality images/art. Pinterest for visual discovery. Imgur/9gag for memes/viral images. Mastodon/Lemmy for federated/decentralized communities. Sogou WeChat essential within its ecosystem.\n- **Selection/Overlap/Prioritization:** Low overlap between platforms. Query target dictates choice. 'Find discussion on topic X' -> Reddit, Lemmy Posts, Mastodon hashtags. 'Find user Y' -> Reddit, Lemmy Users, Mastodon Users. 'Find images/inspiration for Z' -> Pinterest, Flickr, DeviantArt. 'Find meme/GIF A' -> Imgur, 9gag. 'Find WeChat article B' -> Sogou WeChat. Selection is about identifying the target platform or desired content type (discussion vs image vs profile).",
    "discussion_on_weighting": "High impact based on target platform. Searching Reddit for a Mastodon user will fail. Weighting is about correctly identifying the social platform relevant to the query. Within a platform type (e.g., federated search with Lemmy/Mastodon), choice might depend on configured instance capabilities (comment vs post search).",
    "discussion_on_format_specificity": "Moderate to high specificity. Results are typically:\n- **Discussion Threads/Posts:** Reddit, Lemmy Posts, Mastodon via Tootfinder/Hashtags.\n- **Comments:** Lemmy Comments.\n- **User Profiles:** Reddit, Lemmy Users, Mastodon Users.\n- **Image/Visual Posts:** Pinterest, Imgur, Flickr, DeviantArt, 9gag.\n- **Community/Subreddit Listings:** Reddit, Lemmy Communities.\n- **Articles (within ecosystem):** Sogou WeChat. Understanding if the user seeks a discussion, a specific user, visual content, or a community page is key.",
    "other_notes": "Federated search engines (Lemmy, Mastodon, Tootfinder) require instance configuration in SearXNG. Sogou WeChat stability potentially low due to integration."
  }
]
